# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap 'adoptopenjdk/openjdk'

# ------------------------------------------------------------------------------
# Mac Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## System
# ------------------------------------------------------------------------------
cask 'the-unarchiver'
cask 'gpg-suite-no-mail'
cask 'appcleaner'
cask 'suspicious-package'
cask 'android-file-transfer'
cask 'cyberduck'
cask 'nordvpn'
cask 'transmission'

# ------------------------------------------------------------------------------
# Quicklook Plugins
# ------------------------------------------------------------------------------
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'jupyter-notebook-ql'
cask 'qlstephen'
cask 'qlmarkdown'

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Shell Utilities
# ------------------------------------------------------------------------------
brew 'coreutils'
brew 'findutils'
brew 'gnupg'
brew 'jq'
brew 'q'
brew 'ack'
brew 'the_silver_searcher'
brew 'speedtest-cli'
brew 'syncthing'

# ------------------------------------------------------------------------------
## Network Utilities
# ------------------------------------------------------------------------------
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

# ------------------------------------------------------------------------------
# Editors
# ------------------------------------------------------------------------------
cask 'visual-studio-code'
cask 'macdown'

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask 'sourcetree'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'gas-mask'
cask 'android-platform-tools'
cask 'vagrant'
cask 'imageoptim'
cask 'iterm2'

# ------------------------------------------------------------------------------
## Database
# ------------------------------------------------------------------------------
# brew 'mysql'

# ------------------------------------------------------------------------------
## Containers
# ------------------------------------------------------------------------------
# brew 'docker-compose'
# cask 'docker'

# ------------------------------------------------------------------------------
## Virtualization
# ------------------------------------------------------------------------------
# cask 'parallels'

# ------------------------------------------------------------------------------
# Media & Content Creation Tools
# ------------------------------------------------------------------------------
# cask 'gimp'
# cask 'handbrake'

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Dev Utilities
# ------------------------------------------------------------------------------
brew 'diff-so-fancy'
brew 'reattach-to-user-namespace'
brew 'git'
brew 'git-lfs'
brew 'gist'
brew 'hub'
brew 'w3m'
brew 'imagemagick'
brew 'openssl'
brew 'ssh-copy-id'

# ------------------------------------------------------------------------------
## SDKs
# ------------------------------------------------------------------------------
brew 'nvm'
brew 'node'
brew 'yarn'
brew 'go'
brew 'python'
cask 'adoptopenjdk'