# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'romkatv/powerlevel10k'

# ------------------------------------------------------------------------------
# Essential Apps
# ------------------------------------------------------------------------------
cask 'authy'
cask 'bartender'
cask 'bettertouchtool'
cask 'alfred'
cask 'visual-studio-code'

# ------------------------------------------------------------------------------
# Mac Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Productivity
# ------------------------------------------------------------------------------
cask 'authy'
cask 'alfred'
cask 'brave-browser'
cask 'notion'

# ------------------------------------------------------------------------------
## Communication
# ------------------------------------------------------------------------------
cask 'telegram-desktop'
cask 'signal'

# ------------------------------------------------------------------------------
## System
# ------------------------------------------------------------------------------
cask 'bartender'
cask 'bettertouchtool'
cask 'logitech-options'
cask 'boom-3d'

# ------------------------------------------------------------------------------
## Media Apps
# ------------------------------------------------------------------------------
cask 'mpv'

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Shell Utilities
# ------------------------------------------------------------------------------
brew 'zsh'
brew 'autojump'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-navigation-tools'
brew 'romkatv/powerlevel10k/powerlevel10k'

# ------------------------------------------------------------------------------
## System Utilities
# ------------------------------------------------------------------------------
brew 'terminal-notifier'
brew 'tree'
brew 'trash'
brew 'mackup'
brew 'folderify'